tester/src/main/resources/requests/GeefPersoonRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v02="http://magda.vlaanderen.be/persoon/soap/geefpersoon/v02_02">
    <soapenv:Header/>
    <soapenv:Body>
        <v02:GeefPersoon>
            <Verzoek>
                <Context>
                    <Naam>GeefPersoon</Naam>
                    <Versie>02.02.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>2020-01-09</Datum>
                            <Tijd>09:52:45.528</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>MockUser</Identificatie>
                            <Referte>XE_780102:2806:49535:37513</Referte>
                            <Hoedanigheid>188</Hoedanigheid>
                        </Afzender>
                        <Ontvanger>
                            <Identificatie>vip.vlaanderen.be</Identificatie>
                        </Ontvanger>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>a9e3e799-f0d5-4842-a196-fb7c322884fa</Referte>
                        <Inhoud>
                            <Criteria>
                                <INSZ>00000099504</INSZ>
                                <OpvragingenKSZ>
                                    <BasisPersoonsgegevens>1</BasisPersoonsgegevens>
                                    <Afstamming>0</Afstamming>
                                    <AfstammingDalendeLijn>0</AfstammingDalendeLijn>
                                    <Identiteitsbewijs>0</Identiteitsbewijs>
                                    <Beroepskaart>0</Beroepskaart>
                                    <Arbeidskaart>0</Arbeidskaart>
                                    <WettigVerblijf>0</WettigVerblijf>
                                    <AdministratieveToestand>0</AdministratieveToestand>
                                    <PlaatsInschrijving>0</PlaatsInschrijving>
                                </OpvragingenKSZ>
                            </Criteria>
                            <Bron>RR</Bron>
                            <Taal>nl</Taal>
                        </Inhoud>
                    </Vraag>
                </Vragen>
            </Verzoek>
        </v02:GeefPersoon>
    </soapenv:Body>
</soapenv:Envelope>