interfaces/src/main/resources/templates/GeefPersoon/02.02.0000/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <GeefPersoon xmlns="http://magda.vlaanderen.be/persoon/soap/geefpersoon/v02_02">
            <Verzoek xmlns="">
                <Context>
                    <Naam>GeefPersoon</Naam>
                    <Versie>02.02.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>DATUM</Datum>
                            <Tijd>TIJD</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>akb.vlaanderen.be/aiv/burgerloket-wwoom-mock</Identificatie>
                            <Referte>833dd928-ffc2-42fe-83d7-12e71d191f8d</Referte>
                            <Hoedanigheid>a1300</Hoedanigheid>
                        </Afzender>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>vraagreferte</Referte>
                        <Inhoud>
                            <Criteria>
                                <INSZ>INSZ</INSZ>
                                <OpvragingenKSZ>
                                    <BasisPersoonsgegevens>1</BasisPersoonsgegevens>
                                </OpvragingenKSZ>
                            </Criteria>
                            <Bron>RR</Bron>
                            <Taal>nl</Taal>
                        </Inhoud>
                    </Vraag>
                </Vragen>
            </Verzoek>
        </GeefPersoon>
    </soapenv:Body>
</soapenv:Envelope>